# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

5.times do |i|
  p 'i'
  User.create(email: "user_#{i}@gmail.com", password: 'password')

  Article.create(title: 'Медицина. Новий час',
                 text: "Зростання промислового виробництва привернуло увагу до вивчення професійних захворювань. На межі XVII—XVIII століть італійський лікар Бернардіно Рамацціні поклав початок вивченню промислової патології та гігієни праці. З розвитком медицини зародилися в різних країнах медичні навчальні заклади. У XVIII столітті в Російській імперії створили Академію наук (1724 рік) і Медичну колегію (1763 рік) — адміністративні центри в галузі медицини, а також відкрили кілька медичних шкіл. У 1773 році відкрили Медичний колегіум у Львові, який у 1784 році об'єднали з медичним факультетом Львівського університету, у 1787 році — Єлизаветградську медико-хірургічну школу. Одним з основних закладів, що комплектували слухачів медичних шкіл, була Київська академія, де наприкінці XVIII століття почали викладати медицину (в 1802 році відкрили медичний клас — першим його викладачем став О. Ф. Масловський). У 2-й половині XVIII століття — 1-й половині XIX століття заклали основи військової та морської гігієни. Одним з основоположників епідеміології був український лікар Данило Самойлович (2-а половина XVIII століття). Німецький вчений Роберт Кох став одним з основоположників мікробіології. Основи експериментальної фармакології, токсикології ендокринології заклав французький фізіолог і патолог Клод Бернар. Праці німецького фізіолога Германа Гельмгольца, чеського біолога Яна Пуркинє сприяли прогресу офтальмології. Дослідження австрійського патолога Рудольфа Вірхова зробили реформи у теоретичній і практичній медицині, заклали підвалини клітинної теорії та патологічної анатомії. У цей час було збільшено кількість медичних навчальних закладів, зокрема в Україні в 1805 році відкрили медичний факультет при Харківському, в 1841 році — при Київському університетах (були створені відомі київська, харківська, а згодом й одеська медичні школи); виникли медичні наукові товариства (зокрема Товариство київських лікарів), медична спільнота видавала кілька медичних наукових журналів.",
                 user: User.last)
end
